//* TASK #1 =======================================================
var friends = [
	"Даша",
	"Максим",
	"Никита",
]

$("h1").text("Мои друзья:")

for (var i = 0; i < friends.length; i++) {
	$(".wrapper").append(`<p>${friends[i]}</p>`)
	$("p").last().hide().fadeIn((i + 1) * 1000)
}

$("p").hide().fadeIn(1000).append(" лучший!")



//* TASK #2 =======================================================
for (var i = 0; i < 5; i++) {
	var fadeTime = (i + 1) * 1000 / 2
	$("h1").fadeOut(fadeTime).fadeIn(fadeTime)
}



//* TASK #3 =======================================================
$("h2").fadeOut(1000).delay(5000).fadeIn(1000)



//* TASK #4 =======================================================
$("h1").fadeTo(2000, 0.5)